/* 
  Localizable.strings (English)
  MidTVWallpaper
*/

// MARK: - General
"app.name" = "AI Stream Wallpaper";
"app.version" = "Version";

// MARK: - Common
"common.add" = "Add";
"common.cancel" = "Cancel";
"common.close" = "Close";
"common.delete" = "Delete";
"common.save" = "Save";
"common.done" = "Done";
"common.ok" = "OK";

// MARK: - Main Window Sidebar
"main.content" = "Content";
"main.settings" = "Settings";
"main.library" = "Library";
"main.streaming" = "Streaming";
"main.display" = "Display";
"main.shortcuts" = "Shortcuts";
"main.general" = "General";

// MARK: - Menu Bar
"menu.midjourneyTV" = "Midjourney TV";
"menu.library" = "Library";
"menu.play" = "Play";
"menu.pause" = "Pause";
"menu.saveVideo" = "Save Current Video";
"menu.copyPrompt" = "Copy Prompt";
"menu.mute" = "Mute";
"menu.unmute" = "Unmute";
"menu.shuffle" = "Shuffle";
"menu.sequential" = "In Order";
"menu.playOrder" = "Play Order";
"menu.repeat" = "Repeat";
"menu.switchToLibrary" = "Switch to Library";
"menu.switchToStreaming" = "Switch to Streaming";
"menu.openLibrary" = "Open Library...";
"menu.openSettings" = "Settings...";
"menu.settings" = "Settings...";
"menu.launchAtLogin" = "Launch at Login";
"menu.quit" = "Quit";
"menu.previous" = "Previous";
"menu.next" = "Next";
"menu.noVideo" = "No video available";
"menu.videosInLibrary" = "videos in library";
"menu.streamingConnection" = "Streaming Connection";
"menu.connected" = "Connected";
"menu.disconnected" = "Disconnected";
"menu.autoSaveCount" = "Auto-save limit";
"menu.videos" = "videos";
"menu.saveToDownloads" = "Save to Downloads";
"menu.hideCurrentVideo" = "Hide This Video";

// MARK: - Library
"library.title" = "Library";
"library.search" = "Search...";
"library.showFavorites" = "Show favorites only";
"library.empty" = "Library is empty";
"library.noResults" = "No results found";
"library.emptyTip" = "Enable streaming connection to automatically save videos";
"library.enableStreaming" = "Enable Streaming Connection";
"library.addLocal" = "Add Local Video";
"library.setAsWallpaper" = "Set as Wallpaper";
"library.close" = "Close";
"library.videos" = "videos";
"library.favorites" = "favorites";
"library.plays" = "plays";
"library.addToFavorites" = "Add to Favorites";
"library.removeFromFavorites" = "Remove from Favorites";
"library.showInFinder" = "Show in Finder";
"library.delete" = "Delete";
"library.refresh" = "Refresh";
"library.copyPrompt" = "Copy Prompt";
"library.dislike" = "Hide Video";
"library.openInMidjourney" = "Open in Midjourney";

// MARK: - Sort Options
"sort.recentFirst" = "Recently Saved";
"sort.oldestFirst" = "Oldest First";
"sort.nameAZ" = "Name (A-Z)";
"sort.nameZA" = "Name (Z-A)";
"sort.mostPlayed" = "Most Played";
"sort.shortest" = "Shortest";
"sort.longest" = "Longest";

// MARK: - Streaming Settings
"streaming.connectionStatus" = "Connection Status";
"streaming.connected" = "Connected";
"streaming.disconnected" = "Disconnected";
"streaming.connect" = "Connect";
"streaming.disconnect" = "Disconnect";
"streaming.source" = "Video Source";
"streaming.default" = "Default";
"streaming.addCustomUrl" = "Add Custom URL";
"streaming.enterUrl" = "Enter URL...";
"streaming.autoSave" = "Auto-Save";
"streaming.autoSaveEnabled" = "Save to Library";
"streaming.autoSaveEnabledInfo" = "When disabled, videos play directly without saving to the library.";
"streaming.maxVideos" = "Maximum Videos";
"streaming.autoSaveInfo" = "New videos are automatically saved to your library. Older videos are removed to maintain the limit.";
"streaming.description" = "Streaming connection downloads videos to your library automatically";
"streaming.connection" = "Connection";
"streaming.enableConnection" = "Enable streaming connection";
"streaming.online" = "Online";
"streaming.offline" = "Offline";
"streaming.autoSaveCount" = "Keep latest videos";
"streaming.autoSaveTip" = "New videos are automatically saved, older ones are removed to maintain the limit";
"streaming.libraryCount" = "Current library";
"streaming.sources" = "Video Sources";
"streaming.sourceName" = "Name";
"streaming.sourceURL" = "URL";
"streaming.add" = "Add";

// MARK: - Display Settings
"display.preview" = "Preview";
"display.adjustments" = "Adjustments";
"display.transparency" = "Transparency";
"display.brightness" = "Brightness";
"display.saturation" = "Saturation";
"display.blur" = "Blur";
"display.presets" = "Presets";
"display.preset.default" = "Default";
"display.preset.subtle" = "Subtle";
"display.preset.dim" = "Dim";
"display.preset.ambient" = "Ambient";
"display.preset.focus" = "Focus";
"display.preset.vivid" = "Vivid";
"display.preset.cinema" = "Cinema";
"display.preset.neon" = "Neon";
"display.preset.dreamy" = "Dreamy";
"display.preset.night" = "Night";
"display.preset.warm" = "Warm";
"display.preset.retro" = "Retro";
"display.preset.cool" = "Cool";
"display.preset.soft" = "Soft";

// MARK: - Shortcuts Settings
"shortcuts.accessibilityPermission" = "Accessibility Permission";
"shortcuts.permissionGranted" = "Permission Granted";
"shortcuts.permissionNotGranted" = "Permission Not Granted";
"shortcuts.grantPermission" = "Grant Permission";
"shortcuts.permissionRequired" = "Permission Required";
"shortcuts.permissionMessage" = "Global shortcuts require Accessibility permission. Open System Settings to grant access.";
"shortcuts.permissionInfo" = "Without accessibility permission, global shortcuts won't work. You can still use the menu bar controls.";
"shortcuts.openSettings" = "Open System Settings";
"shortcuts.globalShortcuts" = "Global Shortcuts";
"shortcuts.nextVideo" = "Next Video";
"shortcuts.previousVideo" = "Previous Video";
"shortcuts.togglePlayPause" = "Play/Pause";
"shortcuts.copyPrompt" = "Copy Prompt";
"shortcuts.toggleMiniController" = "Toggle Mini Controller";
"shortcuts.pressKey" = "Press keys...";
"shortcuts.notSet" = "Not Set";
"shortcuts.miniController" = "Mini Controller";
"shortcuts.enableMiniController" = "Enable Mini Controller";
"shortcuts.miniControllerInfo" = "A floating panel for quick playback controls";
"shortcuts.title" = "Shortcuts";
"shortcuts.prevVideo" = "Previous video";
"shortcuts.saveVideo" = "Save video";
"shortcuts.toggleMute" = "Toggle mute";
"shortcuts.playPause" = "Play/Pause";
"shortcuts.openLibrary" = "Open library";
"shortcuts.showControls" = "Show/Hide Controls";
"shortcuts.pressKeys" = "Press keys...";
"shortcuts.tip" = "💡 Click a shortcut to change it. Use modifiers (⌘⌥⌃⇧) with a key.";
"shortcuts.accessibilityNote" = "⚠️ Global shortcuts require Accessibility permission in System Settings → Privacy & Security → Accessibility";
"shortcuts.multiMonitorTip" = "🖥️ With multiple monitors, shortcuts apply to the monitor where the mouse cursor is located.";

// MARK: - General Settings
"general.language" = "Language";
"general.selectLanguage" = "Select Language";
"general.systemDefault" = "System Default";
"general.languageInfo" = "Some changes may require an app restart";
"general.playback" = "Playback";
"general.repeatMode" = "Repeat Mode";
"general.shuffle" = "Shuffle";
"general.autoPlay" = "Auto-play on launch";
"general.displayMode" = "Display Mode";
"general.useAsWallpaper" = "Use as Wallpaper";
"general.useAsWallpaperInfo" = "Display videos as desktop background";
"general.useAsScreensaver" = "Use as Screensaver";
"general.useAsScreensaverInfo" = "Display videos when system is idle";
"general.screensaverIdleTime" = "Start after";
"general.minutes1" = "1 minute";
"general.minutes2" = "2 minutes";
"general.minutes5" = "5 minutes";
"general.minutes10" = "10 minutes";
"general.minutes15" = "15 minutes";
"general.minutes30" = "30 minutes";
"general.startup" = "Startup";
"general.launchAtLogin" = "Launch at Login";
"general.launchAtLoginInfo" = "Start AI Stream Wallpaper when you log in";
"general.startMinimized" = "Start Minimized";
"general.startMinimizedInfo" = "Don't show windows on launch";
"general.about" = "About";
"general.version" = "Version";
"general.librarySize" = "Library Size";
"general.storageUsed" = "Storage Used";
"general.clearLibrary" = "Clear Library";
"general.clearLibraryConfirm" = "Clear Library?";
"general.clearLibraryWarning" = "This will delete all videos from your library. This action cannot be undone.";
"general.audio" = "Audio";
"general.mute" = "Mute";
"general.playbackInfo" = "Library videos are always looped";
"general.autoPause" = "Auto Pause";
"general.pauseOnBattery" = "Pause on battery power";
"general.pauseOnFullscreen" = "Pause when fullscreen app is active";
"general.schedule" = "Schedule";
"general.enableSchedule" = "Enable active hours";
"general.startTime" = "Start";
"general.endTime" = "End";
"general.storageLocation" = "Storage Location";
"general.change" = "Change...";
"general.showNotification" = "Show notification when video is saved";

// MARK: - Repeat Modes
"repeat.none" = "No Repeat";
"repeat.one" = "Repeat One";
"repeat.all" = "Repeat All";

// MARK: - Playback Modes
"mode.streaming" = "Live Streaming";
"mode.library" = "My Library";

// MARK: - Notifications
"notification.saved" = "Video Saved";
"notification.saveFailed" = "Save Failed";
"notification.copied" = "✓ Copied";
"notification.copyFailed" = "⚠ Copy Failed";
"notification.promptCopied" = "Prompt copied to clipboard";
"notification.promptNotFound" = "Prompt not found";
"notification.noWebView" = "Web view not available";
"notification.noVideoURL" = "Video URL not found. Please wait for the video to load.";

// MARK: - Quality Options
"quality.auto" = "Auto";
"quality.high" = "High";
"quality.medium" = "Medium";
"quality.low" = "Low";

// MARK: - Settings Tabs (Legacy)
"settings.title" = "Settings";
"settings.general" = "General";
"settings.source" = "Source";
"settings.streaming" = "Streaming";
"settings.overlay" = "Display";
"settings.monitor" = "Monitor";
"settings.shortcuts" = "Shortcuts";

// MARK: - Source Settings (Legacy)
"source.videoSources" = "Video Sources";
"source.addSource" = "Add Source";
"source.name" = "Name";
"source.url" = "URL";
"source.add" = "Add";
"source.builtIn" = "Built-in";
"source.tip" = "💡 Midjourney TV is always available as the default source.";

// MARK: - Overlay Settings (Legacy)
"overlay.description" = "Adjust so the background video doesn't distract from work";
"overlay.opacity" = "Opacity";
"overlay.opacityTip" = "Lower values make the background more transparent";
"overlay.brightness" = "Brightness";
"overlay.brightnessTip" = "Darker settings reduce eye strain";
"overlay.saturation" = "Saturation";
"overlay.saturationTip" = "Lower values approach grayscale";
"overlay.blur" = "Blur";
"overlay.blurTip" = "Adding blur can improve focus";
"overlay.reset" = "Reset to Default";

// MARK: - Monitor Settings
"monitor.detected" = "Detected Monitors";
"monitor.notFound" = "No monitors found";
"monitor.primary" = "Primary";
"monitor.refresh" = "Refresh Monitors";

// MARK: - Language Settings
"language.title" = "Language";
"language.system" = "System Default";
"language.english" = "English";
"language.korean" = "한국어";
"language.restartRequired" = "Restart the app to apply language changes";
